app/Models/CommentaireModel.php

	public function getCommentaireTache(int $idTache): ?array
	{
		return $this->where('id_tache', $idTache)
					->findAll(); // Récupère tous les enregistrements correspondants
---
SELECT *
FROM "commentaire"
WHERE "id_tache" = 1

	public function getUtilisateur(Commentaire $commentaire): Utilisateur
	{
		$utilisateurModele = new UtilisateurModel();
		return $utilisateurModele->find($commentaire->getIdUtilisateur());
---
SELECT *
FROM "utilisateur"
WHERE "utilisateur"."id_utilisateur" = 1