app/Models/TacheModel.php

    public function getTacheById(int $idTache): ?\App\Entities\Tache
    {
        return $this->find($idTache); // Utilisation de la méthode native find()
---
SELECT *
FROM "tache"
WHERE "tache"."id_tache" = 1